[
  "obsidian-code-block-enhancer",
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "excalibrain",
  "dataview",
  "obsidian-enhancing-mindmap",
  "obsidian-git",
  "obsidian-plantuml",
  "mousewheel-image-zoom",
  "contribution-widget",
  "contribution-graph",
  "obsidian-weread-plugin",
  "convert-url-to-iframe"
]