[
  "obsidian-code-block-enhancer",
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "excalibrain",
  "dataview",
  "obsidian-enhancing-mindmap",
  "obsidian-plantuml",
  "mousewheel-image-zoom",
  "obsidian-weread-plugin",
  "convert-url-to-iframe",
  "obsidian-to-anki-plugin",
  "copilot",
  "contribution-graph",
  "templater-obsidian",
  "components"
]